# Creating an Explicit Database Connection

In [ ]:
from sqlalchemy import create_engine
db = create_engine("postgresql://student:w4111student@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111")
connection = db.connect()  # first connect to the database

Now you can use the database connection to run queries in Python

In [ ]:
cursor = connection.execute("select 1")  # run a query.  it does not return the actual rows.  it returns a cursor
rows = cursor.fetchall()  # ask cursor to give us all the result rows
print(rows)

# Using Jupyter Magic

The following is syntax that asks jupyter to handle the database connection for us, so we just write "%sql"  statements.  It sets the Jupyter notebook environment

In [15]:
%load_ext sql
%config SqlMagic.autocommit=False
%sql postgresql://localhost/w4111

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [2]:
%sql SELECT 1

 * postgresql://student:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111
1 rows affected.

[(1,)]

In [4]:
%%sql

SELECT 1

 * postgresql://student:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111
1 rows affected.

[(1,)]

In [8]:
%%sql
DROP TABLE IF EXISTS sailors cascade;
DROP TABLE IF EXISTS boats cascade;
DROP TABLE IF EXISTS reserves;

CREATE TABLE sailors(
    sid serial primary key,
    name text,
    rating int,
    age int    
);
create table boats(
    bid serial primary key,
    name text,
    color text
);
create table reserves(
    sid int references sailors,
    bid int references boats,
    day text
);

INSERT INTO sailors VALUES 
(1, 'Eugene', 7, 22),
(2, 'Luis', 2, 39),
(3, 'Ken', 8, 27);
INSERT INTO boats VALUES
(101, 'Legacy', 'red'),
(102, 'Melon', 'blue'),
(103, 'Mars', 'red');
INSERT INTO reserves VALUES
(1, 102, '9/12/2016'),
(1, 101, '9/12/2016'),
(1, 103, '9/12/2016'),
(2, 102, '9/13/2016'),
(2, 103, '9/14/2016');

 * postgresql://student:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111
Done.
Done.
Done.
Done.
Done.
Done.
3 rows affected.
3 rows affected.
5 rows affected.

[]

In [16]:
%%sql
SELECT * FROM sailors s1
WHERE s1.age >= ALL (SELECT s2.age FROM sailors s2)

 * postgresql://localhost/w4111
   postgresql://student:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111
1 rows affected.

[(2, 'Luis', 2, 39)]

In [20]:
%sql SELECT * FROM boats

 * postgresql://localhost/w4111
   postgresql://student:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111
3 rows affected.

[(101, 'Legacy', 'red'), (102, 'Melon', 'blue'), (103, 'Mars', 'red')]

In [22]:
%%sql
SELECT s.*
FROM Sailors S
WHERE NOT EXISTS (
    SELECT *
    FROM reserves r
    WHERE NOT EXISTS (   -- boats b that sailor s has not reserved
        SELECT *
        FROM boats b
        WHERE s.sid = r.sid AND b.bid = r.bid
    )
    
)

 * postgresql://localhost/w4111
   postgresql://student:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111
0 rows affected.

[]

In [29]:
%%sql
SELECT count(*)
FROM reserves r
WHERE sid = 2

 * postgresql://localhost/w4111
   postgresql://student:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111
1 rows affected.

[(2,)]

In [30]:
%%sql

SELECT *
FROM sailors s
WHERE (SELECT count(distinct bid)
       FROM reserves r
       WHERE r.sid = s.sid) = (SELECT count(*) FROM boats)

 * postgresql://localhost/w4111
   postgresql://student:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111
1 rows affected.

[(1, 'Eugene', 7, 22)]

In [38]:
%%sql
SELECT s.sid
FROM sailors s, reserves r
WHERE s.sid = r.sid
GROUP BY s.sid
HAVING count(*) = ( SELECT COUNT(*) FROM boats)

 * postgresql://localhost/w4111
   postgresql://student:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111
1 rows affected.

[(1, 3)]

In [41]:
%%sql
DROP TABLE IF EXISTS l, r CASCADE;
CREATE TABLE l(a int, b int);
CREATE TABLE r(b int, c int);
INSERT INTO l VALUES (1,1), (2,2);
INSERT INTO r VALUES (2,3), (4,5);

 * postgresql://localhost/w4111
   postgresql://student:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111
Done.
Done.
Done.
2 rows affected.
2 rows affected.

[]

In [50]:
%sql select * from l FULL JOIN r ON l.b = r.b;

 * postgresql://localhost/w4111
   postgresql://student:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111
3 rows affected.

[(1, 1, None, None), (2, 2, 2, 3), (None, None, 4, 5)]

In [ ]:
\pi_{a} T JOIN_b S

\pi_{a}(T) JOIN_b S
\pi_{a}(T JOIN_b S)

In [ ]:
T(a, b)
S(a, b, c)

 \sigma_{T.b = 1} T JOIN_a T = result(a, b, b)

In [49]:
%%sql
SELECT * FROM sailors s
WHERE s.sid IN (SUBQUERY)

WHERE EXISTS (SELECT * FROM SUBQUERY WHERE s.sid = SUBQUERY.???)

 * postgresql://localhost/w4111
   postgresql://student:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111
(psycopg2.errors.SyntaxError) syntax error at or near "("
LINE 2: WHERE EXISTS (SELECT 1 FROM VALUES(1) WHERE s.sid = 1);
                                          ^

[SQL: SELECT * FROM sailors s
WHERE EXISTS (SELECT 1 FROM VALUES(1) WHERE s.sid = 1);]
(Background on this error at: http://sqlalche.me/e/f405)

In [55]:
%%sql
SELECT tmp.rating
FROM 	(SELECT	S.rating, AVG(S.age) as avgage
		   FROM	Sailors S
	   GROUP BY	S.rating) AS tmp
WHERE	tmp.avgage = (
	SELECT MIN(tmp2.avgage) FROM tmp AS tmp2
)

 * postgresql://localhost/w4111
   postgresql://student:***@w4111.cisxo09blonu.us-east-1.rds.amazonaws.com/w4111
(psycopg2.errors.UndefinedTable) relation "tmp" does not exist
LINE 5:  SELECT MIN(tmp2.avgage) FROM tmp AS tmp2
                                      ^

[SQL: SELECT tmp.rating FROM (SELECT	S.rating, AVG(S.age) as avgage
		   FROM	Sailors S
	   GROUP BY	S.rating) AS tmp
WHERE	tmp.avgage = (
	SELECT MIN(tmp2.avgage) FROM tmp AS tmp2
)]
(Background on this error at: http://sqlalche.me/e/f405)